# Data Preprocessing: AI/ML/Data Science Salary Trends

**Author:** Data Preprocessing Lead (Member 1)  
**Date:** November 2025  
**Objective:** Clean and prepare salary data for analysis and forecasting

---

## Table of Contents
1. [Setup & Imports](#setup)
2. [Load Dataset](#load)
3. [Initial Exploration](#explore)
4. [Data Cleaning](#cleaning)
5. [Feature Engineering](#features)
6. [Data Aggregation](#aggregation)
7. [Export Cleaned Data](#export)
8. [Summary Statistics](#summary)

## 1. Setup & Imports <a id='setup'></a>

In [23]:
# Import required libraries
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
from datetime import datetime
import warnings
import sys
import os
sys.path.insert(0, os.path.join(os.path.dirname(os.getcwd()), 'src'))
warnings.filterwarnings('ignore')

# Set display options
pd.set_option('display.max_columns', None)
pd.set_option('display.max_rows', 100)
pd.set_option('display.float_format', lambda x: '%.2f' % x)

# Set visualization style
sns.set_style('whitegrid')
plt.rcParams['figure.figsize'] = (12, 6)

print("‚úÖ Libraries imported successfully")
print(f"Pandas version: {pd.__version__}")
print(f"NumPy version: {np.__version__}")

‚úÖ Libraries imported successfully
Pandas version: 2.3.3
NumPy version: 2.3.4

## 2. Load Dataset <a id='load'></a>

**Note:** Update the file path to match your local setup

In [24]:
# Load the dataset
# TODO: Update this path to your actual data location
DATA_PATH = '../data/raw/ai_ml_salaries.csv'  

try:
    df = pd.read_csv(DATA_PATH)
    print(f"‚úÖ Dataset loaded successfully!")
    print(f"Shape: {df.shape[0]:,} rows √ó {df.shape[1]} columns")
except FileNotFoundError:
    print("‚ùå File not found. Please check the path and try again.")
    print(f"Looking for: {DATA_PATH}")

‚úÖ Dataset loaded successfully!
Shape: 151,445 rows √ó 11 columns

## 3. Initial Exploration <a id='explore'></a>

In [25]:
# Display first few rows
print("üìä First 5 rows of the dataset:")
display(df.head())

üìä First 5 rows of the dataset:

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2025,EX,FT,Head of Data,348516,USD,348516,US,0,US,M
1,2025,EX,FT,Head of Data,232344,USD,232344,US,0,US,M
2,2025,SE,FT,Data Scientist,145400,USD,145400,US,0,US,M
3,2025,SE,FT,Data Scientist,81600,USD,81600,US,0,US,M
4,2025,MI,FT,Engineer,160000,USD,160000,US,100,US,M

In [26]:
# Dataset info
print("üìã Dataset Information:")
df.info()

üìã Dataset Information:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 151445 entries, 0 to 151444
Data columns (total 11 columns):
 #   Column              Non-Null Count   Dtype
---  ------              --------------   -----
 0   work_year           151445 non-null  int64
 1   experience_level    151445 non-null  object
 2   employment_type     151445 non-null  object
 3   job_title           151445 non-null  object
 4   salary              151445 non-null  int64
 5   salary_currency     151445 non-null  object
 6   salary_in_usd       151445 non-null  int64
 7   employee_residence  151445 non-null  object
 8   remote_ratio        151445 non-null  int64
 9   company_location    151445 non-null  object
 10  company_size        151445 non-null  object
dtypes: int64(4), object(7)
memory usage: 12.7+ MB

In [27]:
# Basic statistics
print("üìà Descriptive Statistics:")
display(df.describe())

üìà Descriptive Statistics:

       work_year      salary  salary_in_usd  remote_ratio
count  151445.00   151445.00      151445.00     151445.00
mean     2024.44   162837.96      157527.46         20.94
std         0.67   208012.40       74150.77         40.62
min      2020.00    14000.00       15000.00          0.00
25%      2024.00   106000.00      105800.00          0.00
50%      2025.00   147000.00      146100.00          0.00
75%      2025.00   199000.00      198000.00          0.00
max      2025.00 30400000.00      800000.00        100.00

In [28]:
# Check for missing values
print("üîç Missing Values Analysis:")
missing_data = pd.DataFrame({
    'Column': df.columns,
    'Missing_Count': df.isnull().sum(),
    'Missing_Percentage': (df.isnull().sum() / len(df) * 100).round(2)
})
missing_data = missing_data[missing_data['Missing_Count'] > 0].sort_values('Missing_Count', ascending=False)

if len(missing_data) == 0:
    print("‚úÖ No missing values found!")
else:
    display(missing_data)

üîç Missing Values Analysis:
‚úÖ No missing values found!

In [29]:
# Check for duplicates
duplicates = df.duplicated().sum()
print(f"üîÑ Duplicate rows: {duplicates:,} ({duplicates/len(df)*100:.2f}%)")

üîÑ Duplicate rows: 79,532 (52.52%)

In [30]:
# Unique values in categorical columns
print("üìä Unique Values in Categorical Columns:")
categorical_cols = ['work_year', 'experience_level', 'employment_type', 
                    'job_title', 'company_size', 'remote_ratio']

for col in categorical_cols:
    if col in df.columns:
        print(f"\n{col}: {df[col].nunique()} unique values")
        print(df[col].value_counts().head(10))

üìä Unique Values in Categorical Columns:

work_year: 6 unique values
work_year
2025    78726
2024    62241
2023     8524
2022     1661
2021      218
2020       75
Name: count, dtype: int64

experience_level: 4 unique values
experience_level
SE    87491
MI    46128
EN    13663
EX     4163
Name: count, dtype: int64

employment_type: 4 unique values
employment_type
FT    150541
CT       467
PT       421
FL        16
Name: count, dtype: int64

job_title: 422 unique values
job_title
Data Scientist               18751
Software Engineer            16948
Data Engineer                16352
Data Analyst                 13779
Engineer                     11004
Machine Learning Engineer     8887
Manager                       7811
Analyst                       5396
Research Scientist            3460
Product Manager               2576
Name: count, dtype: int64

company_size: 3 unique values
company_size
M    147302
L      3926
S       217
Name: count, dtype: int64

remote_ratio: 3 unique values
remote_ratio
0      119570
100     31546
50        329
Name: count, dtype: int64

## 4. Data Cleaning <a id='cleaning'></a>

In [31]:
# Create a copy for cleaning
df_clean = df.copy()
print(f"Starting with {len(df_clean):,} rows")

Starting with 151,445 rows

In [32]:
# Step 1: Remove duplicates
before_dedup = len(df_clean)
df_clean = df_clean.drop_duplicates()
after_dedup = len(df_clean)
print(f"‚úÖ Removed {before_dedup - after_dedup:,} duplicate rows")

‚úÖ Removed 79,532 duplicate rows

In [33]:
# Step 2: Filter for relevant years (2020-2025)
if 'work_year' in df_clean.columns:
    before_filter = len(df_clean)
    df_clean = df_clean[df_clean['work_year'].between(2020, 2025)]
    after_filter = len(df_clean)
    print(f"‚úÖ Filtered to 2020-2025: {after_filter:,} rows ({before_filter - after_filter:,} removed)")
    print(f"   Year distribution: {df_clean['work_year'].value_counts().sort_index().to_dict()}")

‚úÖ Filtered to 2020-2025: 71,913 rows (0 removed)
   Year distribution: {2020: 75, 2021: 214, 2022: 1114, 2023: 4538, 2024: 27690, 2025: 38282}

In [34]:
# Step 3: Filter for AI/ML/Data Science roles
# Define relevant job title keywords
ai_ml_keywords = [
    'data scientist', 'data science', 'machine learning', 'ml engineer',
    'ai engineer', 'artificial intelligence', 'data engineer',
    'analytics engineer', 'data analyst', 'research scientist',
    'deep learning', 'nlp engineer', 'computer vision', 'mlops'
]

if 'job_title' in df_clean.columns:
    before_filter = len(df_clean)
    
    # Create a mask for relevant job titles
    mask = df_clean['job_title'].str.lower().str.contains('|'.join(ai_ml_keywords), na=False)
    df_clean = df_clean[mask]
    
    after_filter = len(df_clean)
    print(f"‚úÖ Filtered to AI/ML/Data Science roles: {after_filter:,} rows ({before_filter - after_filter:,} removed)")
    print(f"\nTop 10 job titles:")
    print(df_clean['job_title'].value_counts().head(10))

‚úÖ Filtered to AI/ML/Data Science roles: 29,324 rows (42,589 removed)

Top 10 job titles:
job_title
Data Scientist                7160
Data Engineer                 7071
Data Analyst                  6405
Machine Learning Engineer     3462
Research Scientist            1381
Analytics Engineer            1341
AI Engineer                   1163
Machine Learning Scientist     359
MLOps Engineer                 165
Computer Vision Engineer       135
Name: count, dtype: int64

In [35]:
# Step 4: Handle missing values in critical columns
critical_cols = ['work_year', 'salary_in_usd', 'experience_level', 'employment_type']

before_dropna = len(df_clean)
for col in critical_cols:
    if col in df_clean.columns:
        df_clean = df_clean.dropna(subset=[col])

after_dropna = len(df_clean)
print(f"‚úÖ Removed rows with missing critical values: {before_dropna - after_dropna:,} rows dropped")

‚úÖ Removed rows with missing critical values: 0 rows dropped

In [36]:
# Step 5: Remove outliers (optional - based on salary)
# Remove salaries that are unrealistically low or high
if 'salary_in_usd' in df_clean.columns:
    before_outliers = len(df_clean)
    
    # Define reasonable salary range (adjust as needed)
    MIN_SALARY = 10000  # $10K minimum
    MAX_SALARY = 1000000  # $1M maximum
    
    df_clean = df_clean[
        (df_clean['salary_in_usd'] >= MIN_SALARY) & 
        (df_clean['salary_in_usd'] <= MAX_SALARY)
    ]
    
    after_outliers = len(df_clean)
    print(f"‚úÖ Removed salary outliers: {before_outliers - after_outliers:,} rows")
    print(f"   Salary range: ${df_clean['salary_in_usd'].min():,.0f} - ${df_clean['salary_in_usd'].max():,.0f}")

‚úÖ Removed salary outliers: 0 rows
   Salary range: $15,000 - $793,136

In [37]:
# Step 6: Standardize categorical variables
# Map experience levels
if 'experience_level' in df_clean.columns:
    exp_level_mapping = {
        'EN': 'Entry',
        'MI': 'Mid',
        'SE': 'Senior',
        'EX': 'Executive'
    }
    df_clean['experience_level_full'] = df_clean['experience_level'].map(exp_level_mapping)
    print("‚úÖ Mapped experience levels")

# Map employment types
if 'employment_type' in df_clean.columns:
    emp_type_mapping = {
        'FT': 'Full-time',
        'PT': 'Part-time',
        'CT': 'Contract',
        'FL': 'Freelance'
    }
    df_clean['employment_type_full'] = df_clean['employment_type'].map(emp_type_mapping)
    print("‚úÖ Mapped employment types")

# Map company sizes
if 'company_size' in df_clean.columns:
    company_size_mapping = {
        'S': 'Small',
        'M': 'Medium',
        'L': 'Large'
    }
    df_clean['company_size_full'] = df_clean['company_size'].map(company_size_mapping)
    print("‚úÖ Mapped company sizes")

‚úÖ Mapped experience levels
‚úÖ Mapped employment types
‚úÖ Mapped company sizes

## 5. Feature Engineering <a id='features'></a>

In [38]:
# Create remote work category
if 'remote_ratio' in df_clean.columns:
    def categorize_remote(ratio):
        if ratio == 0:
            return 'Onsite'
        elif ratio == 100:
            return 'Remote'
        else:
            return 'Hybrid'
    
    df_clean['remote_category'] = df_clean['remote_ratio'].apply(categorize_remote)
    print("‚úÖ Created remote work category")
    print(df_clean['remote_category'].value_counts())

‚úÖ Created remote work category
remote_category
Onsite    21065
Remote     7997
Hybrid      262
Name: count, dtype: int64

In [39]:
# Create salary bands for analysis
if 'salary_in_usd' in df_clean.columns:
    salary_bins = [0, 50000, 100000, 150000, 200000, float('inf')]
    salary_labels = ['<$50K', '$50K-$100K', '$100K-$150K', '$150K-$200K', '>$200K']
    
    df_clean['salary_band'] = pd.cut(
        df_clean['salary_in_usd'], 
        bins=salary_bins, 
        labels=salary_labels
    )
    print("‚úÖ Created salary bands")
    print(df_clean['salary_band'].value_counts().sort_index())

‚úÖ Created salary bands
salary_band
<$50K          1435
$50K-$100K     7256
$100K-$150K    8475
$150K-$200K    6169
>$200K         5989
Name: count, dtype: int64

## 6. Data Aggregation <a id='aggregation'></a>

Create aggregated datasets for different analyses

In [40]:
# Aggregate 1: Average salary by year (for time series forecasting)
avg_salary_by_year = df_clean.groupby('work_year').agg({
    'salary_in_usd': ['mean', 'median', 'count', 'std']
}).round(2)

avg_salary_by_year.columns = ['avg_salary', 'median_salary', 'count', 'std_salary']
avg_salary_by_year = avg_salary_by_year.reset_index()

print("üìä Average Salary by Year:")
display(avg_salary_by_year)

üìä Average Salary by Year:

   work_year  avg_salary  median_salary  count  std_salary
0       2020   103012.42       82416.50     74    83021.85
1       2021    96672.36       80000.00    198    66327.48
2       2022   130011.91      128875.00    992    60313.53
3       2023   153022.35      145000.00   3571    71275.46
4       2024   150537.64      138067.00  11812    77231.23
5       2025   145439.56      131700.00  12677    77742.19

In [41]:
# Aggregate 2: Salary by year and experience level
salary_by_year_exp = df_clean.groupby(['work_year', 'experience_level_full']).agg({
    'salary_in_usd': ['mean', 'count']
}).round(2)

salary_by_year_exp.columns = ['avg_salary', 'count']
salary_by_year_exp = salary_by_year_exp.reset_index()

print("üìä Salary by Year and Experience Level:")
display(salary_by_year_exp.head(15))

üìä Salary by Year and Experience Level:

    work_year experience_level_full  avg_salary  count
0        2020                 Entry    71037.90     20
1        2020             Executive   179958.25      4
2        2020                   Mid    91870.94     31
3        2020                Senior   138648.89     19
4        2021                 Entry    63892.00     44
5        2021             Executive   174535.00      8
6        2021                   Mid    82745.71     79
7        2021                Senior   125323.72     67
8        2022                 Entry    73969.91     90
9        2022             Executive   185105.60     35
10       2022                   Mid   100385.26    267
11       2022                Senior   148388.27    600
12       2023                 Entry    88773.01    257
13       2023             Executive   193814.28    147
14       2023                   Mid   127478.11    841

In [42]:
# Aggregate 3: Salary by year and company size
salary_by_year_size = df_clean.groupby(['work_year', 'company_size_full']).agg({
    'salary_in_usd': ['mean', 'count']
}).round(2)

salary_by_year_size.columns = ['avg_salary', 'count']
salary_by_year_size = salary_by_year_size.reset_index()

print("üìä Salary by Year and Company Size:")
display(salary_by_year_size.head(15))

üìä Salary by Year and Company Size:

    work_year company_size_full  avg_salary  count
0        2020             Large   114311.97     34
1        2020            Medium   113195.06     17
2        2020             Small    78782.43     23
3        2021             Large   103574.59    111
4        2021            Medium    82742.40     48
5        2021             Small    94172.13     39
6        2022             Large   117562.59    152
7        2022            Medium   134999.64    798
8        2022             Small    80299.79     42
9        2023             Large   113362.83    161
10       2023            Medium   155724.56   3366
11       2023             Small    91420.64     44
12       2024             Large   128335.64    204
13       2024            Medium   151023.81  11587
14       2024             Small    97965.67     21

In [43]:
# Aggregate 4: Salary by employment type
salary_by_emp_type = df_clean.groupby(['work_year', 'employment_type_full']).agg({
    'salary_in_usd': ['mean', 'count']
}).round(2)

salary_by_emp_type.columns = ['avg_salary', 'count']
salary_by_emp_type = salary_by_emp_type.reset_index()

print("üìä Salary by Employment Type:")
display(salary_by_emp_type)

üìä Salary by Employment Type:

    work_year employment_type_full  avg_salary  count
0        2020             Contract    68251.00      3
1        2020            Freelance    60000.00      1
2        2020            Full-time   107654.87     68
3        2020            Part-time    18817.50      2
4        2021             Contract   263666.67      3
5        2021            Freelance    40000.00      2
6        2021            Full-time    95749.76    189
7        2021            Part-time    43355.75      4
8        2022             Contract    69545.25      4
9        2022            Freelance    76841.00      3
10       2022            Full-time   130761.63    979
11       2022            Part-time    74578.83      6
12       2023             Contract    99314.40     10
13       2023            Freelance    39250.00      4
14       2023            Full-time   153371.75   3554
15       2023            Part-time    69820.00      3
16       2024             Contract   112689.18     62
17       2024            Freelance    30000.00      1
18       2024            Full-time   151070.08  11689
19       2024            Part-time    87928.90     60
20       2025             Contract    95402.34    122
21       2025            Full-time   146263.11  12484
22       2025            Part-time    86613.51     71

## 7. Export Cleaned Data <a id='export'></a>

In [44]:
# Create output directory if it doesn't exist
import os
os.makedirs('data/processed', exist_ok=True)

# Export main cleaned dataset
output_path_main = 'data/processed/salary_data_cleaned.csv'
df_clean.to_csv(output_path_main, index=False)
print(f"‚úÖ Exported cleaned dataset: {output_path_main}")
print(f"   Shape: {df_clean.shape}")

# Export aggregated datasets
avg_salary_by_year.to_csv('data/processed/average_salary_by_year.csv', index=False)
print(f"‚úÖ Exported: average_salary_by_year.csv")

salary_by_year_exp.to_csv('data/processed/salary_by_year_experience.csv', index=False)
print(f"‚úÖ Exported: salary_by_year_experience.csv")

salary_by_year_size.to_csv('data/processed/salary_by_year_company_size.csv', index=False)
print(f"‚úÖ Exported: salary_by_year_company_size.csv")

salary_by_emp_type.to_csv('data/processed/salary_by_employment_type.csv', index=False)
print(f"‚úÖ Exported: salary_by_employment_type.csv")

‚úÖ Exported cleaned dataset: data/processed/salary_data_cleaned.csv
   Shape: (29324, 16)
‚úÖ Exported: average_salary_by_year.csv
‚úÖ Exported: salary_by_year_experience.csv
‚úÖ Exported: salary_by_year_company_size.csv
‚úÖ Exported: salary_by_employment_type.csv

## 8. Summary Statistics <a id='summary'></a>

In [45]:
print("="*60)
print("DATA PREPROCESSING SUMMARY")
print("="*60)
print(f"\nüìä Dataset Overview:")
print(f"   Original rows: {len(df):,}")
print(f"   Final rows: {len(df_clean):,}")
print(f"   Rows removed: {len(df) - len(df_clean):,} ({(len(df) - len(df_clean))/len(df)*100:.2f}%)")
print(f"   Final columns: {len(df_clean.columns)}")

print(f"\nüí∞ Salary Statistics (USD):")
print(f"   Mean: ${df_clean['salary_in_usd'].mean():,.2f}")
print(f"   Median: ${df_clean['salary_in_usd'].median():,.2f}")
print(f"   Min: ${df_clean['salary_in_usd'].min():,.2f}")
print(f"   Max: ${df_clean['salary_in_usd'].max():,.2f}")
print(f"   Std Dev: ${df_clean['salary_in_usd'].std():,.2f}")

print(f"\nüìÖ Time Period:")
print(f"   Years covered: {df_clean['work_year'].min()} - {df_clean['work_year'].max()}")
print(f"   Total years: {df_clean['work_year'].nunique()}")

print(f"\nüë• Experience Levels:")
print(df_clean['experience_level_full'].value_counts())

print(f"\nüè¢ Company Sizes:")
print(df_clean['company_size_full'].value_counts())

print(f"\nüíº Employment Types:")
print(df_clean['employment_type_full'].value_counts())

print(f"\nüè† Remote Work Distribution:")
print(df_clean['remote_category'].value_counts())

print(f"\nüìà Year-over-Year Growth:")
for i in range(len(avg_salary_by_year) - 1):
    year_current = avg_salary_by_year.iloc[i+1]['work_year']
    year_prev = avg_salary_by_year.iloc[i]['work_year']
    salary_current = avg_salary_by_year.iloc[i+1]['avg_salary']
    salary_prev = avg_salary_by_year.iloc[i]['avg_salary']
    growth = ((salary_current - salary_prev) / salary_prev) * 100
    print(f"   {year_prev} ‚Üí {year_current}: {growth:+.2f}%")

print("\n" + "="*60)
print("‚úÖ DATA PREPROCESSING COMPLETE")
print("="*60)

============================================================
DATA PREPROCESSING SUMMARY
============================================================

üìä Dataset Overview:
   Original rows: 151,445
   Final rows: 29,324
   Rows removed: 122,121 (80.64%)
   Final columns: 16

üí∞ Salary Statistics (USD):
   Mean: $147,458.28
   Median: $135,700.00
   Min: $15,000.00
   Max: $793,136.00
   Std Dev: $76,455.20

üìÖ Time Period:
   Years covered: 2020 - 2025
   Total years: 6

üë• Experience Levels:
experience_level_full
Senior       15506
Mid           8991
Entry         3987
Executive      840
Name: count, dtype: int64

üè¢ Company Sizes:
company_size_full
Medium    28356
Large       791
Small       177
Name: count, dtype: int64

üíº Employment Types:
employment_type_full
Full-time    28963
Contract       204
Part-time      146
Freelance       11
Name: count, dtype: int64

üè† Remote Work Distribution:
remote_category
Onsite    21065
Remote     7997
Hybrid      262
Name: count, dtype: int64

üìà Year-over-Year Growth:
   2020.0 ‚Üí 2021.0: -6.15%
   2021.0 ‚Üí 2022.0: +34.49%
   2022.0 ‚Üí 2023.0: +17.70%
   2023.0 ‚Üí 2024.0: -1.62%
   2024.0 ‚Üí 2025.0: -3.39%

============================================================
‚úÖ DATA PREPROCESSING COMPLETE
============================================================

## üìù Data Dictionary

### Original Columns
- `work_year`: Year of employment (2020-2025)
- `experience_level`: Career level (EN/MI/SE/EX)
- `employment_type`: Work arrangement (FT/PT/CT/FL)
- `job_title`: Specific role title
- `salary_in_usd`: Standardized salary in USD
- `company_size`: Organization size (S/M/L)
- `remote_ratio`: Remote work percentage (0/50/100)

### Engineered Columns
- `experience_level_full`: Full name of experience level
- `employment_type_full`: Full name of employment type
- `company_size_full`: Full name of company size
- `remote_category`: Categorized remote work (Onsite/Hybrid/Remote)
- `salary_band`: Salary range category

---

## üéØ Next Steps

1. **Share cleaned data** with EDA Lead (Member 2)
2. **Document any data quality issues** discovered
3. **Create data dictionary** for team reference
4. **Review preprocessing decisions** with team

---

**Preprocessing completed:** Nov 7  
**Processed by:** Data Preprocessing Lead - Diana Lucero